In [1]:
import pandas as pd


rev = pd.read_csv("revenue.csv", index_col="Date")

rev.head()

        New York  Los Angeles  Miami
Date
1/1/16       985          122    499
1/2/16       738          788    534
1/3/16        14           20    933
1/4/16       730          904    885
1/5/16       114           71    253

In [2]:
s  = pd.Series([1,2,3])
s.sum()

6

In [3]:
rev.sum()   # Row wise add hoy

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [4]:
rev.sum(axis=0)  # Row wise add hoy

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [14]:
rev.sum(axis="rows")

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [8]:
rev.sum(axis="index")  # Row wise add hoy

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [16]:
rev.sum(axis=1)   # Column wise add hoy

Date
1/1/16     1606
1/2/16     2060
1/3/16      967
1/4/16     2519
1/5/16      438
1/6/16     1935
1/7/16     1234
1/8/16     2313
1/9/16     2623
1/10/16     555
dtype: int64

In [15]:
rev.sum(axis="columns")    # Column wise add hoy

Date
1/1/16     1606
1/2/16     2060
1/3/16      967
1/4/16     2519
1/5/16      438
1/6/16     1935
1/7/16     1234
1/8/16     2313
1/9/16     2623
1/10/16     555
dtype: int64

In [17]:
nba = pd.read_csv("nba.csv")
nba.head(11)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,06-Feb,180,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,06-Jun,235,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,06-May,205,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28,SG,22,06-May,185,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8,PF,29,06-Oct,231,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90,PF,29,06-Sep,240,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55,PF,21,06-Aug,235,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41,C,25,7-0,238,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12,PG,22,06-Feb,190,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36,PG,22,06-Apr,220,Oklahoma State,3431040.0
10,Jared Sullinger,Boston Celtics,7,C,24,06-Sep,260,Ohio State,2569260.0

In [18]:
nba.Name    # eibabe o Series e kaj kora hoy but ...Acueacy 70-80%...tai ei niyom besi vlo na
            # bcoz colomn er name(value) space asle problem hbe...Space na asle perfect...

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
452       Trey Lyles
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
Name: Name, Length: 457, dtype: object

In [19]:
nba.Name.head()

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [20]:
nba.Name.head()

type(nba.Name)

pandas.core.series.Series

In [21]:
nba["Name"]    # ei niyom e korle kono vul hoibo na...>> Space e problem hbe na

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
452       Trey Lyles
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
Name: Name, Length: 457, dtype: object

In [22]:
nba["Name"]

nba["Team"].head()

0    Boston Celtics
1    Boston Celtics
2    Boston Celtics
3    Boston Celtics
4    Boston Celtics
Name: Team, dtype: object

In [23]:
nba[["Team","Name","Weight"]]

               Team           Name  Weight
0    Boston Celtics  Avery Bradley     180
1    Boston Celtics    Jae Crowder     235
2    Boston Celtics   John Holland     205
3    Boston Celtics    R.J. Hunter     185
4    Boston Celtics  Jonas Jerebko     231
..              ...            ...     ...
452       Utah Jazz     Trey Lyles     234
453       Utah Jazz   Shelvin Mack     203
454       Utah Jazz      Raul Neto     179
455       Utah Jazz   Tibor Pleiss     256
456       Utah Jazz    Jeff Withey     231

[457 rows x 3 columns]

In [24]:
Select = ["Team","Name","Weight"]

nba[Select]

               Team           Name  Weight
0    Boston Celtics  Avery Bradley     180
1    Boston Celtics    Jae Crowder     235
2    Boston Celtics   John Holland     205
3    Boston Celtics    R.J. Hunter     185
4    Boston Celtics  Jonas Jerebko     231
..              ...            ...     ...
452       Utah Jazz     Trey Lyles     234
453       Utah Jazz   Shelvin Mack     203
454       Utah Jazz      Raul Neto     179
455       Utah Jazz   Tibor Pleiss     256
456       Utah Jazz    Jeff Withey     231

[457 rows x 3 columns]